[F_TestSword X2SoldierClassTemplate]
DisplayName="F_TestSword"
ClassSummary="Test Sword"
LeftAbilityTreeTitle="Left"
RightAbilityTreeTitle="Right"

[F_TestGremlin X2SoldierClassTemplate]
DisplayName="F_TestGremlin"
ClassSummary="Test Gremlin"
LeftAbilityTreeTitle="Left"
RightAbilityTreeTitle="Right"

[F_TestGrenadeLauncher X2SoldierClassTemplate]
DisplayName="F_TestGrenadeLauncher"
ClassSummary="Test Grenade Launcher"
LeftAbilityTreeTitle="Left"
RightAbilityTreeTitle="Right"

[F_TestPsiAmp X2SoldierClassTemplate]
DisplayName="F_TestPsiAmp"
ClassSummary="F_TestPsiAmp."
LeftAbilityTreeTitle="Left"
RightAbilityTreeTitle="Right"

[F_EyeStrain X2AbilityTemplate]
LocFriendlyName="Eye Strain"
LocFlyOverText="Eye Strain"
LocLongDescription="The soldier focuses intensely, gaining Squadsight and <Ability:EYESTRAIN_AIM_BONUS/> aim for <Ability:EYESTRAIN_DURATION/>. Does not cost an action point. <Ability:EYESTRAIN_CHARGES/> per mission."
LocHelpText="The soldier focuses intensely, gaining Squadsight and <Ability:EYESTRAIN_AIM_BONUS/> aim for <Ability:EYESTRAIN_DURATION/>. Does not cost an action point. <Ability:EYESTRAIN_CHARGES/> per mission."
LocPromotionPopupText="<Bullet/> While active, grants Squadsight for standard shots and any abilities that support it.<br/><Bullet/> While active, grants <Ability:EYESTRAIN_AIM_BONUS/> aim.<br/><Bullet/> Does not cost an action point.<br/><Bullet/> Lasts for <Ability:EYESTRAIN_DURATION/>.<br/><Bullet/> <Ability:EYESTRAIN_CHARGES/> per mission.<br/>"

[F_FreeFire X2AbilityTemplate]
LocFriendlyName="Free Fire"
LocFlyOverText="Free Fire"
LocLongDescription="Fire your primary weapon as a free action. <Ability:FREEFIRE_COOLDOWN/> turn cooldown."
LocHelpText="Fire your primary weapon as a free action. <Ability:FREEFIRE_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Fire your primary weapon as a free action. 5 turn cooldown.<br/><Bullet/> <Ability:FREEFIRE_COOLDOWN/> turn cooldown.<br/>"

[F_ChipAway X2AbilityTemplate]
LocFriendlyName="Chip Away"
LocFlyOverText="Chip Away"
LocLongDescription="Fire a shot with your primary weapon that shreds armor based on weapon tier. Uses <Ability:CHIPAWAY_AMMO_COST/> ammo. <Ability:CHIPAWAY_COOLDOWN/> turn cooldown."
LocHelpText="Fire a shot with your primary weapon that shreds armor based on weapon tier. Uses <Ability:CHIPAWAY_AMMO_COST/> ammo. <Ability:CHIPAWAY_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Fire a shot with your primary weapon that shreds armor based on weapon tier.<br/><Bullet/> Conventional weapons shred <Ability:CHIPAWAY_SHRED_CV/> armor.<br/><Bullet/> Laser weapons shred <Ability:CHIPAWAY_SHRED_LS/> armor.<br/><Bullet/> Magnetic weapons shred <Ability:CHIPAWAY_SHRED_MG/> armor.<br/><Bullet/> Coil weapons shred <Ability:CHIPAWAY_SHRED_CL/> armor.<br/><Bullet/> Beam weapons shred <Ability:CHIPAWAY_SHRED_BM/> armor.<br/><Bullet/> Consumes <Ability:CHIPAWAY_AMMO_COST/> ammo.<br/><Bullet/> <Ability:CHIPAWAY_COOLDOWN/> turn cooldown.<br/>"

[F_Concentration X2AbilityTemplate]
LocFriendlyName="Concentration"
LocFlyOverText="Concentration"
LocLongDescription="Your grazing shots are automatically upgraded to normal hits."
LocHelpText="Your grazing shots are automatically upgraded to normal hits."
LocPromotionPopupText="<Bullet/> Attacks that would normally graze their target are automatically upgraded to normal hits.<br/><Bullet/> Applies to primary weapons, secondary weapons, and pistols.<br/>"

[F_Spot X2AbilityTemplate]
LocFriendlyName="Spot"
LocFlyOverText="Spot"
LocLongDescription="Visually scan a small area, highlighting any enemies in the radius for <Ability:SPOT_DURATION/> turns, even if you lose line of sight. Also reveals Faceless and Chryssalids in the area of effect. <Ability:SPOT_COOLDOWN/> turn cooldown."
LocHelpText="Visually scan a small area, highlighting any enemies in the radius for <Ability:SPOT_DURATION/> turns, even if you lose line of sight. Also reveals Faceless and Chryssalids in the area of effect. <Ability:SPOT_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Visually scan a small area, highlighting any enemies in the radius, even if you lose line of sight.<br/><Bullet/> Any civilians in the area of effect that are secretly Faceless will immediately transform.<br/><Bullet/> Burrowed Chryssalids in the area of effect will immediately unborrow.<br/><Bullet/> Range of <Ability:SPOT_RANGE/> units.<br/><Bullet/> <Ability:SPOT_RADIUS/> tile radius.<br/><Bullet/> <Ability:SPOT_COOLDOWN/> turn cooldown.<br/><Bullet/> Does not reveal the user if concealed.<br/><Bullet/> Does not end the user's turn if used as a first action.<br/>

[F_ReactionProtocol X2AbilityTemplate]
LocFriendlyName="Reaction Protocol"
LocFlyOverText="Reaction Protocol"
LocLongDescription="Grant a Covering Fire overwatch shot to an ally while also giving them the effects of Cool Under Pressure. <Ability:REACTIONPROTOCOL_CHARGES/> per mission."
LocHelpText="Grant a Covering Fire overwatch shot to an ally while also giving them the effects of Cool Under Pressure. <Ability:REACTIONPROTOCOL_CHARGES/> per mission."
LocPromotionPopupText="<Bullet/> Grant a Covering Fire overwatch shot to an ally while also giving them the effects of Cool Under Pressure.<br/><Bullet/> If the target already has Cool Under Pressure, their reaction fire aim is not increased further.<br/><Bullet/> <Ability:REACTIONPROTOCOL_CHARGES/> per mission.<br/>"

[F_Imposition X2AbilityTemplate]
LocFriendlyName="Imposition"
LocFlyOverText="Imposition"
LocLongDescription="Firing at an enemy with the unit's primary weapon modifies the target's aim by <Ability:IMPOSITION_AIM_BONUS/> until next turn."
LocHelpText="Firing at an enemy with the unit's primary weapon modifies the target's aim by <Ability:IMPOSITION_AIM_BONUS/> until next turn."
LocPromotionPopupText="<Bullet/> Firing at an enemy with the unit's primary weapon modifies the target's aim by <Ability:IMPOSITION_AIM_BONUS/> until next turn.<br/><Bullet/> Applies to both standard shots and shots from special abilities.<br/><Bullet/> The effects of this ability do not stack.<br/>"

[F_SnipersEye X2AbilityTemplate]
LocFriendlyName="Sniper's Eye"
LocFlyOverText="Sniper's Eye"
LocLongDescription="Grants <Ability:SNIPERSEYE_AIM_BONUS/> aim against targets in High Cover. Passive"
LocHelpText="Grants <Ability:SNIPERSEYE_AIM_BONUS/> aim against targets in High Cover."
LocPromotionPopupText="<Bullet/> Grants <Ability:SNIPERSEYE_AIM_BONUS/> aim against targets in High Cover.<br/><Bullet/> Passive.<br/><Bullet/> Applies to all attacks.<br/>

[F_Unload X2AbilityTemplate]
LocFriendlyName="Unload"
LocFlyOverText="Unload"
LocLongDescription="Fire with your primary weapon until out of ammo or the target is dead. Shots cannot critically hit and each shot deals less damage than a standard shot. <Ability:UNLOAD_COOLDOWN/> turn cooldown."
LocHelpText="Fire with the unit's primary weapon until out of ammo or the target is dead. Shots cannot critically hit and each shot deals less damage than a standard shot. <Ability:UNLOAD_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Fire with the unit's primary weapon until out of ammo or the target is dead.<br/><Bullet/> Shots cannot critically hit.<br/><Bullet/> Each shot deals <Ability:UNLOAD_DAMAGE_MODIFIER/> damage of a standard shot.<br/><Bullet/> <Ability:UNLOAD_COOLDOWN/> turn cooldown.<br/>

[F_BattleVision X2AbilityTemplate]
LocFriendlyName="Battle Vision"
LocFlyOverText="Battle Vision"
LocLongDescription="Gain <Ability:BATTLEVISION_AIM_BONUS/> aim for each enemy you can see, up to a maximum of <Ability:BATTLEVISION_VALUE_MAX/> aim."
LocHelpText="Gain <Ability:BATTLEVISION_AIM_BONUS/> aim for each enemy you can see, up to a maximum of <Ability:BATTLEVISION_VALUE_MAX/> aim."
LocPromotionPopupText="<Bullet/> Gain <Ability:BATTLEVISION_AIM_BONUS/> aim for each living enemy you can see, up to a maximum of <Ability:BATTLEVISION_VALUE_MAX/> aim.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> Only applies to shots fired with your primary weapon.<br/>"

[F_Entrenched X2AbilityTemplate]
LocFriendlyName="Entrenched"
LocFlyOverText="Entrenched"
LocLongDescription="Full cover provides an additional <Ability:ENTRENCHED_DEFENSE_BONUS/> defense."
LocHelpText="Full cover provides an additional <Ability:ENTRENCHED_DEFENSE_BONUS/> defense."
LocPromotionPopupText="<Bullet/> Full cover provides an additional <Ability:ENTRENCHED_DEFENSE_BONUS/> defense.<br/><Bullet/> Bonus does not apply when flanked.<br/>"

[F_Maim X2AbilityTemplate]
LocFriendlyName="Maim"
LocFlyOverText="Maim"
LocLongDescription="Fire a shot with your primary weapon that immobilizes the target until the end of their next turn. Uses <Ability:MAIM_AMMO_COST/> ammo. <Ability:MAIM_COOLDOWN/> turn cooldown."
LocHelpText="Fire a shot with your primary weapon that immobilizes the target until the end of their next turn. Uses <Ability:MAIM_AMMO_COST/> ammo. <Ability:MAIM_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Fire a shot with your primary weapon that immobilizes the target until the end of their next turn.<br/><Bullet/> Uses <Ability:MAIM_AMMO_COST/> ammo.<br/><Bullet/> <Ability:MAIM_COOLDOWN/> turn cooldown.<br/>"

[F_ExposeWeakness X2AbilityTemplate]
LocFriendlyName="Expose Weakness"
LocFlyOverText="Expose Weakness"
LocLongDescription="Increases damage taken by the targetted unit by <Ability:EXPOSEWEAKNESS_DAMAGEMODIFIER/>. Lasts <Ability:EXPOSEWEAKNESS_DURATION/>. Does not break concealment. <Ability:EXPOSEWEAKNESS_COOLDOWN/> turn cooldown."
LocHelpText="Increases damage taken by the targetted unit by <Ability:EXPOSEWEAKNESS_DAMAGEMODIFIER/>. Lasts <Ability:EXPOSEWEAKNESS_DURATION/>. Does not break concealment. <Ability:EXPOSEWEAKNESS_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Increases damage taken by the targetted unit by <Ability:EXPOSEWEAKNESS_DAMAGEMODIFIER/>.<br/><Bullet/> Lasts <Ability:EXPOSEWEAKNESS_DURATION/>.<br/><Bullet/> Does not break concealment.<br/><Bullet/> <Ability:EXPOSEWEAKNESS_COOLDOWN/> turn cooldown.<br/><Bullet/> Does not end your turn if used as a first action.<br/>"

[F_QuickFeet X2AbilityTemplate]
LocFriendlyName="Quick Feet"
LocFlyOverText="Quick Feet"
LocLongDescription="Refunds one action point when you are revealed from concealment via your own action."
LocHelpText="Refunds one action point when you are revealed from concealment via your own action."
LocPromotionPopupText="<Bullet/> Refunds one action point when you are revealed from concealment via your own action.<br/><Bullet/> Only applies to actions taken during your turn.<br/><Bullet/> Does not activate when using abilities that do not cost an action point.<br/>"

[F_ShootAnyone X2AbilityTemplate]
LocFriendlyName="Shoot Anyone"
LocFlyOverText="Shoot Anyone"
LocLongDescription="Shoot Anyone."
LocHelpText="Shoot Anyone."
LocPromotionPopupText="<Bullet/> Shoot Anyone.<br/>"

[F_DisablingShot X2AbilityTemplate]
LocFriendlyName="Disabling Shot"
LocFlyOverText="Disabling Shot"
LocLongDescription="Primary weapon shot that, if it hits, stuns the target for <Ability:DISABLINGSHOT_STUN_ACTIONS/>. Cannot critically hit. Uses <Ability:DISABLINGSHOT_AMMO_COST/> ammo. <Ability:DISABLINGSHOT_COOLDOWN/> turn cooldown."
LocHelpText="Primary weapon shot that, if it hits, stuns the target for <Ability:DISABLINGSHOT_STUN_ACTIONS/>. Cannot critically hit. Uses <Ability:DISABLINGSHOT_AMMO_COST/> ammo. <Ability:DISABLINGSHOT_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Primary weapon shot that, if it hits, stuns the target for <Ability:DISABLINGSHOT_STUN_ACTIONS/>.<br/><Bullet/> Cannot cause critical hits.<br/><Bullet/> Uses <Ability:DISABLINGSHOT_AMMO_COST/> ammo.<br/><Bullet/> <Ability:DISABLINGSHOT_COOLDOWN/> turn cooldown.<br/>"

[F_Momentum X2AbilityTemplate]
LocFriendlyName="Momentum"
LocFlyOverText="Momentum"
LocLongDescription="Confers <Ability:MOMENTUM_AIM_BONUS/> aim, <Ability:MOMENTUM_CRIT_BONUS/> critical chance, and <Ability:MOMENTUM_DAMAGE_BONUS/> bonus damage with your primary weapon if you have moved this turn."
LocHelpText="Confers <Ability:MOMENTUM_AIM_BONUS/> aim, <Ability:MOMENTUM_CRIT_BONUS/> critical chance, and <Ability:MOMENTUM_DAMAGE_BONUS/> bonus damage with your primary weapon if you have moved this turn."
LocPromotionPopupText="<Bullet/> Confers <Ability:MOMENTUM_AIM_BONUS/> aim, <Ability:MOMENTUM_CRIT_BONUS/> critical chance, and <Ability:MOMENTUM_DAMAGE_BONUS/> bonus damage with your primary weapon if you have moved this turn.<br/>"

[F_Resupply X2AbilityTemplate]
LocFriendlyName="Resupply"
LocFlyOverText="Resupply"
LocLongDescription="Refill the primary weapon ammo of all allies. <Ability:RESUPPLY_CHARGES/> per mission. <Ability:RESUPPLY_ENDTURN/>"
LocHelpText="Refill the primary weapon ammo of all allies. <Ability:RESUPPLY_CHARGES/> per mission. <Ability:RESUPPLY_ENDTURN/>"
LocPromotionPopupText="<Bullet/> Refill the primary weapon ammo of all allies.<br/><Bullet/> <Ability:RESUPPLY_CHARGES/> per mission.<br/><Bullet/> <Ability:RESUPPLY_ENDTURN/><br/>"

[F_BulletTime X2AbilityTemplate]
LocFriendlyName="Bullet Time"
LocFlyOverText="Bullet Time"
LocLongDescription="Activated ability that grants <Ability:BULLETTIME_DEFENSE_BONUS/> bonus defense to the user for <Ability:BULLETTIME_DURATION/>. <Ability:BULLETTIME_CHARGES/> per mission. Does not cost an action point."
LocHelpText="Activated ability that grants <Ability:BULLETTIME_DEFENSE_BONUS/> bonus defense to the user for <Ability:BULLETTIME_DURATION/>. <Ability:BULLETTIME_CHARGES/> per mission. Does not cost an action point."
LocPromotionPopupText="<Bullet/> Activated ability that grants <Ability:BULLETTIME_DEFENSE_BONUS/> bonus defense to the user for <Ability:BULLETTIME_DURATION/>.<br/><Bullet/> <Ability:BULLETTIME_CHARGES/> per mission.<br/><Bullet/> Does not cost an action point.<br/>"

[F_Predator X2AbilityTemplate]
LocFriendlyName="Predator"
LocFlyOverText="Predator"
LocLongDescription="Grants <Ability:PREDATOR_AIM_BONUS/> bonus aim against enemies that are flanked or out of cover. Passive."
LocHelpText="Grants <Ability:PREDATOR_AIM_BONUS/> bonus aim against enemies that are flanked or out of cover. Passive."
LocPromotionPopupText="<Bullet/> Grants <Ability:PREDATOR_AIM_BONUS/> bonus aim against enemies that are flanked or out of cover.<br/><Bullet/> Passive.<br/>"

[F_ArmedToTheTeeth X2AbilityTemplate]
LocFriendlyName="Armed to the Teeth"
LocFlyOverText="Armed to the Teeth"
LocLongDescription="Grants an ammo only utility slot."
LocHelpText="Grants an ammo only utility slot."
LocPromotionPopupText="<Bullet/> Grants an ammo only utility slot.<br/>"

[F_BulletProof X2AbilityTemplate]
LocFriendlyName="Bullet Proof"
LocFlyOverText="Bullet Proof"
LocLongDescription="Confers <Ability:BULLETPROOF_ARMOR/> bonus armor and <Ability:BULLETPROOF_SHIELD/> bonus shield."
LocHelpText="Confers <Ability:BULLETPROOF_ARMOR/> bonus armor and <Ability:BULLETPROOF_SHIELD/> bonus shield."
LocPromotionPopupText="<Bullet/> Confers <Ability:BULLETPROOF_ARMOR/> bonus armor and <Ability:BULLETPROOF_SHIELD/> bonus shield.<br/><Bullet/> Bonuses stack with similar bonuses from other abilities and equipment.<br/>"

[F_StandYourGround X2AbilityTemplate]
LocFriendlyName="Stand Your Ground"
LocFlyOverText="Stand Your Ground"
LocLongDescription="Firing with more than one action point remaining confers a <Ability:STANDYOURGROUND_AIM_BONUS/> aim bonus. Passive."
LocHelpText="Firing with more than one action point remaining confers a <Ability:STANDYOURGROUND_AIM_BONUS/> aim bonus. Passive."
LocPromotionPopupText="<Bullet/> Firing with more than one action point remaining confers a <Ability:STANDYOURGROUND_AIM_BONUS/> aim bonus.<br/><Bullet/> Requires that the shot consumes at least <Ability:STANDYOURGROUND_REQUIRED_ACTION_POINTS_SPENT/>.<br/><Bullet/> Passive.<br/>"

[F_CutsThroughSteel X2AbilityTemplate]
LocFriendlyName="Cuts Through Steel"
LocFlyOverText="Cuts Through Steel"
LocLongDescription="Your melee attacks against robotic enemies shred armor based on secondary weapon tier and have <Ability:CUTSTHROUGHSTEEL_CRIT_BONUS/> bonus critical chance."
LocHelpText="Your melee attacks against robotic enemies shred armor based on secondary weapon tier and have <Ability:CUTSTHROUGHSTEEL_CRIT_BONUS/> bonus critical chance."
LocPromotionPopupText="<Bullet/> Your melee attacks against robotic enemies shred armor based on secondary weapon tier.<br/><Bullet/> Conventional weapons shred <Ability:CUTSTHROUGHSTEEL_SHRED_CV/> armor.<br/><Bullet/> Magnetic weapons shred <Ability:CUTSTHROUGHSTEEL_SHRED_MG/> armor.<br/><Bullet/> Beam weapons shred <Ability:CUTSTHROUGHSTEEL_SHRED_BM/> armor.<br/><Bullet/> Confers <Ability:CUTSTHROUGHSTEEL_CRIT_BONUS/> bonus critical chance against robotic targets.<br/>"

[F_InTheZone X2AbilityTemplate]
LocFriendlyName="In The Zone"
LocFlyOverText="In The Zone"
LocLongDescription="Killing a flanked target with your primary weapon refunds one action point. <Ability:INTHEZONE_MAX_REFUNDS_PER_TURN/>"
LocHelpText="Killing a flanked target with your primary weapon refunds one action point. <Ability:INTHEZONE_MAX_REFUNDS_PER_TURN/>"
LocPromotionPopupText="<Bullet/> Killing a flanked target refunds one action point.<br/><Bullet/> Only activates with abilities that use your primary weapon.<br/><Bullet/> <Ability:INTHEZONE_MAX_REFUNDS_PER_TURN/><br/><Bullet/> Does not activate against patrolling enemies.<br/>"

[F_LivingVirus X2AbilityTemplate]
LocFriendlyName="Living Virus"
LocFlyOverText="Living Virus"
LocLongDescription="Grants increased aim, critical chance, and defense against robotic enemies."
LocHelpText="Grants increased aim, critical chance, and defense against robotic enemies."
LocPromotionPopupText="Grants increased aim, critical chance, and defense against robotic enemies.<br/>"

[F_Havoc X2AbilityTemplate]
LocFriendlyName="Havoc"
LocFlyOverText="Havoc"
LocLongDescription="Suppression and Area Suppression now deal a small amount of guarenteed damage. However, targets cannot be killed with this effect."
LocHelpText="Suppression and Area Suppression now deal a small amount of guarenteed damage. However, targets cannot be killed with this effect."
LocPromotionPopupText="<Bullet/> Suppression deals <Ability:HAVOC_DAMAGE_SINGLE/> damage.<br/><Bullet/> Area Suppression deals <Ability:HAVOC_DAMAGE_MULTIPLE/> damage.<br/><Bullet/> Can apply Shredder if you have it.<br/><Bullet/> Does not apply ammo effects.<br/><Bullet/> If the Havoc effect would deal enough damage to kill the target, it is instead left with 1 health remaining.<br/>"

[F_OlympicDash X2AbilityTemplate]
LocFriendlyName="Olympic Dash"
LocFlyOverText="Olympic Dash"
LocLongDescription="Free action. Gain <Ability:OLYMPICDASH_MOBILITY/> mobility and ignore reaction fire for the rest of the turn. <Ability:OLYMPICDASH_COOLDOWN/> turn cooldown."
LocHelpText="Free action. Gain <Ability:OLYMPICDASH_MOBILITY/> mobility and ignore reaction fire for the rest of the turn. <Ability:OLYMPICDASH_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Gain <Ability:OLYMPICDASH_MOBILITY/> mobility and ignore reaction fire for the rest of the turn.<br/><Bullet/> Free action.<br/><Bullet/> <Ability:OLYMPICDASH_COOLDOWN/> turn cooldown.<br/><Bullet/> Lasts for <Ability:OLYMPICDASH_DURATION/>.<br/>"

[F_InGoodHealth X2AbilityTemplate]
LocFriendlyName="In Good Heatlh"
LocFlyOverText="In Good Heatlh"
LocLongDescription="Confers an additional <Ability:INGOODHEALTH_AIM_BONUS/> aim and <Ability:INGOODHEALTH_DAMAGE_BONUS/> damage while you are at full health. The bonus is removed when the unit takes damage the first time during a mission."
LocHelpText="Confers an additional <Ability:INGOODHEALTH_AIM_BONUS/> aim and <Ability:INGOODHEALTH_DAMAGE_BONUS/> damage while you are at full health. The bonus is removed when the unit takes damage the first time during a mission."
LocPromotionPopupText="<Bullet/> Confers an additional <Ability:INGOODHEALTH_AIM_BONUS/> aim and <Ability:INGOODHEALTH_DAMAGE_BONUS/> damage while you are at full health.<br/><Bullet/> Bonus is not restored if you are healed back to full health.<br/>"

[F_Genji X2AbilityTemplate]
LocFriendlyName="Genji"
LocFlyOverText="Genji"
LocLongDescription="Confers <Ability:GENJI_CRITICAL_CHANCE/> bonus critical chance with Sword attacks."
LocHelpText="Confers <Ability:GENJI_CRITICAL_CHANCE/> bonus critical chance with Sword attacks."
LocPromotionPopupText="<Bullet/> Confers <Ability:GENJI_CRITICAL_CHANCE/> bonus critical chance with Sword attacks.<br/>"

[F_SlashAndDash X2AbilityTemplate]
LocFriendlyName="Slash And Dash"
LocFlyOverText="Slash And Dash"
LocLongDescription="Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown."
LocHelpText="Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown.<br/>"

[F_SlashAndDashActivator X2AbilityTemplate]
LocFriendlyName="Slash And Dash"
LocFlyOverText="Slash And Dash"
LocLongDescription="Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown."
LocHelpText="Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Free action. After your next sword attack this turn, gain a free move. <Ability:SLASHANDDASH_COOLDOWN/> turn cooldown.<br/>"

[F_TrenchWarfare X2AbilityTemplate]
LocFriendlyName="Trench Warfare"
LocFlyOverText="Trench Warfare"
LocLongDescription="If you get at least one kill during your turn, automatically Hunker Down at the end of it."
LocHelpText="If you get at least one kill during your turn, automatically Hunker Down at the end of it."
LocPromotionPopupText="<Bullet/> If you get at least one kill during your turn, automatically Hunker Down at the end of it.<br/><Bullet/> You will only Hunker Down if you would normally be able to.<br/>"

[F_LockNLoad X2AbilityTemplate]
LocFriendlyName="Lock 'N Load"
LocFlyOverText="Lock 'N Load"
LocLongDescription="Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take. <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown."
LocHelpText="Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take. <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take.<br/><Bullet/> Shots and abilities still require you to have the required amount of ammo in your weapon.<br/><Bullet/> <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown.<br/>"

[F_LockNLoadActivator X2AbilityTemplate]
LocFriendlyName="Lock 'N Load"
LocFlyOverText="Lock 'N Load"
LocLongDescription="Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take. <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown."
LocHelpText="Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take. <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Activated ability that does not cost an action point. For the remainder of this turn, your ammo will be refunded after each shot you take.<br/><Bullet/> Shots and abilities still require you to have the required amount of ammo in your weapon.<br/><Bullet/> <Ability:LOCKNLOAD_COOLDOWN/> turn cooldown.<br/>"

[F_SaltInTheWound X2AbilityTemplate]
LocFriendlyName="Salt in the Wound"
LocFlyOverText="Salt in the Wound"
LocLongDescription="All attacks deal <Ability:SALTINTHEWOUND_DAMAGE_BONUS/> bonus damage to enemies that are Poisoned, Burning, or Acid Burning."
LocHelpText="All attacks deal <Ability:SALTINTHEWOUND_DAMAGE_BONUS/> bonus damage to enemies that are Poisoned, Burning, or Acid Burning."
LocPromotionPopupText="<Bullet/> All attacks deal <Ability:SALTINTHEWOUND_DAMAGE_BONUS/> bonus damage to enemies that are Poisoned, Burning, or Acid Burning.<br/><Bullet/> Applies to all sources of damage caused by you.<br/>"

[F_TheBiggerTheyAre X2AbilityTemplate]
LocFriendlyName="The Bigger They Are"
LocFlyOverText="The Bigger They Are"
LocLongDescription="Grants <Ability:THEBIGGERTHEYARE_AIM_BONUS/> bonus aim against targets that cannot take cover."
LocHelpText="Grants <Ability:THEBIGGERTHEYARE_AIM_BONUS/> bonus aim against targets that cannot take cover."
LocPromotionPopupText="<Bullet/> Grants <Ability:THEBIGGERTHEYARE_AIM_BONUS/> bonus aim against targets that cannot take cover.<br/><Bullet/> Enemies include, but are not limited to: Drones, MECs, and Berserkers.<br/>"

[F_MindBlast X2AbilityTemplate]
LocFriendlyName="Mind Blast"
LocFlyOverText="Mind Blast"
LocLongDescription="Deal a small amount of damage and stun the target for <Ability:MINDBLAST_STUN_ACTIONS/>. <Ability:MINDBLAST_COOLDOWN/> turn cooldown."
LocHelpText="Deal a small amount of damage and stun the target for <Ability:MINDBLAST_STUN_ACTIONS/>. <Ability:MINDBLAST_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Conventional weapons deal 1 damage.<br/><Bullet/> Magnetic weapons deal 2 damage.<br/><Bullet/> Beam weapons deal 3 damage.<br/><Bullet/> Stuns the target for <Ability:MINDBLAST_STUN_ACTIONS/>.<br/><Bullet/> <Ability:MINDBLAST_COOLDOWN/> turn cooldown.<br/><Bullet/> Guarenteed to hit.<br/><Bullet/> Only can be used against organic targets.<br/>"

[F_EmpoweredBlast X2AbilityTemplate]
LocFriendlyName="Empowered Blast"
LocFlyOverText="Empowered Blast"
LocLongDescription="Mind Blast now applies Rupture to the target."
LocHelpText="Mind Blast now applies Rupture to the target."
LocPromotionPopupText="Mind Blast now applies Rupture to the target.<br/>"

[F_StrengthInNumbers X2AbilityTemplate]
LocFriendlyName="Strength in Numbers"
LocFlyOverText="Strength in Numbers"
LocLongDescription="Gain <Ability:STRENGTHINNUMBERS_AIM_BONUS/> aim for each ally you can see, up to a maximum of <Ability:STRENGTHINNUMBERS_SCALE_MAX/> aim."
LocHelpText="Gain <Ability:STRENGTHINNUMBERS_AIM_BONUS/> aim for each ally you can see, up to a maximum of <Ability:STRENGTHINNUMBERS_SCALE_MAX/> aim."
LocPromotionPopupText="<Bullet/> Gain <Ability:STRENGTHINNUMBERS_AIM_BONUS/> aim for each living ally you can see, up to a maximum of <Ability:STRENGTHINNUMBERS_SCALE_MAX/> aim.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> Only applies to shots fired with your primary weapon.<br/>"

[F_Recharge X2AbilityTemplate]
LocFriendlyName="Recharge"
LocFlyOverText="Recharge"
LocLongDescription="Killing an enemy with your primary weapon reduces the cooldown of all abilities by <Ability:RECHARGE_COOLDOWN_AMOUNT/>."
LocHelpText="Killing an enemy with your primary weapon reduces the cooldown of all abilities by <Ability:RECHARGE_COOLDOWN_AMOUNT/>."
LocPromotionPopupText="<Bullet/> Killing an enemy with your primary weapon reduces the cooldown of all abilities by <Ability:RECHARGE_COOLDOWN_AMOUNT/>.<br/>"

[F_PierceTheVeil X2AbilityTemplate]
LocFriendlyName="Pierce the Veil"
LocFlyOverText="Pierce the Veil"
LocLongDescription="Activated ability that confers bonus aim, damage, and armor piercing to organic targets with your primary weapon, while increasing the cooldown of all of your other abilities."
LocHelpText="Activated ability that confers bonus aim, damage, and armor piercing to organic targets with your primary weapon, while increasing the cooldown of all of your other abilities."
LocPromotionPopupText="<Bullet/> Activated ability that confers bonus aim, damage, and armor piercing to organic targets with your primary weapon, while increasing the cooldown of all of your other abilities.<br/><Bullet/> <Ability:PIERCETHEVEIL_DAMAGE_BONUS/> bonus damage.<br/><Bullet/> <Ability:PIERCETHEVEIL_AIM_BONUS/> bonus aim.<br/><Bullet/> <Ability:PIERCETHEVEIL_ARMOR_PIERCING/> bonus armor piercing.<br/><Bullet/> Lasts for <Ability:PIERCETHEVEIL_DURATION/>.<br/><Bullet/> <Ability:PIERCETHEVEIL_COOLDOWN/> turn cooldown.<br/><Bullet/> Increases the cooldown of all other abilities by <Ability:PIERCETHEVEIL_INCREASE_COOLDOWN_AMOUNT/>.<br/><Bullet/> Ability cooldowns cannot be increased above their maximum cooldown.<br/>"

[F_Ignite X2AbilityTemplate]
LocFriendlyName="Ignite"
LocFlyOverText="Ignite"
LocLongDescription="Light an organic enemy on fire. <Ability:IGNITE_COOLDOWN/> turn cooldown."
LocHelpText="Light an organic enemy on fire. <Ability:IGNITE_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Light an organic enemy on fire.<br/><Bullet/> <Ability:IGNITE_COOLDOWN/> turn cooldown.<br/><Bullet/> Does not deal any direct damage.<br/><Bullet/> The burning effect deals <Ability:IGNITE_BURN_DAMAGE_BASE/> damage, plus or minus <Ability:IGNITE_BURN_DAMAGE_SPREAD/> damage, per turn.<br/>"

[F_NaturalTwenty X2AbilityTemplate]
LocFriendlyName="Natural Twenty"
LocFlyOverText="Natural Twenty"
LocLongDescription="Activated ability that does not cost an action. Guarentees that all successful shots fired until next turn are critical hits. <Ability:NATURALTWENTY_COOLDOWN/> turn cooldown."
LocHelpText="Activated ability that does not cost an action. Guarentees that all successful shots fired until next turn are critical hits. <Ability:NATURALTWENTY_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Guarentees that all successful shots fired until next turn are critical hits.<br/><Bullet/> <br/><Bullet/> Activated ability that does not cost an action.<br/><Bullet/> <Ability:NATURALTWENTY_COOLDOWN/> turn cooldown.<br/><Bullet/> Applies to reaction shots.<br/>"

[F_Regeneration X2AbilityTemplate]
LocFriendlyName="Regeneration"
LocFlyOverText="Regeneration"
LocLongDescription="Restore health to an ally gradually over time. <Ability:REGENERATION_COOLDOWN/> turn cooldown."
LocHelpText="Restore health to an ally gradually over time. <Ability:REGENERATION_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Conventional Psi Amps restore <Ability:REGENERATION_HEALAMOUNT_CV/> health per turn up to a maximum of <Ability:REGENERATION_MAXHEALAMOUNT_CV/>.<br/><Bullet/> Magnetic Psi Amps restore <Ability:REGENERATION_HEALAMOUNT_MG/> health per turn up to a maximum of <Ability:REGENERATION_MAXHEALAMOUNT_MG/>.<br/><Bullet/> Beam Psi Amps restore <Ability:REGENERATION_HEALAMOUNT_BM/> health per turn up to a maximum of <Ability:REGENERATION_MAXHEALAMOUNT_BM/>.<br/><Bullet/> <Ability:REGENERATION_COOLDOWN/> turn cooldown.<br/><Bullet/> The effect will stay on the target until the maximum amount of health is restored.<br/><Bullet/> Can be used on full health allies, so that the regeneration effect will kick in when they take damage.<br/><Bullet/> Can only be used on each ally once per mission.<br/><Bullet/> Healing effect occurs at the end of the player's turn.<br/>"

[F_ThousandsToGo X2AbilityTemplate]
LocFriendlyName="Thousands To Go"
LocFlyOverText="Thousands To Go"
LocLongDescription="Once per turn, after killing an enemy with your primary weapon, you may take an additional non-movement action. Passive."
LocHelpText="Once per turn, after killing an enemy with your primary weapon, you may take an additional non-movement action. Passive."
LocPromotionPopupText="<Bullet/> Once per turn, after killing an enemy with your primary weapon, you may take an additional non-movement action.<br/><Bullet/> Passive.<br/>"

[F_Opportunist X2AbilityTemplate]
LocFriendlyName="Opportunist"
LocFlyOverText="Opportunist"
LocLongDescription="Missed reaction fire shots are automatically updated to grazes. Passive."
LocHelpText="Missed reaction fire shots are automatically updated to grazes. Passive."
LocPromotionPopupText="<Bullet/> Missed reaction fire shots are automatically upgraded to grazes.<br/><Bullet/> Applies to primary weapons and pistols.<br/><Bullet/> Passive.<br/>"

[F_LickYourWounds X2AbilityTemplate]
LocFriendlyName="Lick Your Wounds"
LocFlyOverText="Lick Your Wounds"
LocLongDescription="Hunker Down restores <Ability:LICKYOURWOUNDS_HEALAMOUNT/> health when used, up to a maximum of <Ability:LICKYOURWOUNDS_MAXHEALAMOUNT/> per mission, and removes poison, burning, and acid burning. Passive."
LocHelpText="Hunker Down restores <Ability:LICKYOURWOUNDS_HEALAMOUNT/> health when used, up to a maximum of <Ability:LICKYOURWOUNDS_MAXHEALAMOUNT/> per mission, and removes poison, burning, and acid burning. Passive."
LocPromotionPopupText="<Bullet/> Hunker Down restores <Ability:LICKYOURWOUNDS_HEALAMOUNT/> health when used, up to a maximum of <Ability:LICKYOURWOUNDS_MAXHEALAMOUNT/> per mission.<br/><Bullet/> Removes poison, burning, and acid burning.<br/><Bullet/> Passive.<br/>"

[F_OnARoll X2AbilityTemplate]
LocFriendlyName="On A Roll"
LocFlyOverText="On A Roll"
LocLongDescription="Every kill with your primary weapon grants <Ability:ONAROLL_CRIT_BONUS/> bonus critical hit chance and <Ability:ONAROLL_CRIT_DAMAGE_BONUS/> critical hit damage for the remainder of the mission. Effect stacks up to <Ability:ONAROLL_MAX_STACKS/> times. Passive."
LocHelpText="Every kill with your primary weapon grants <Ability:ONAROLL_CRIT_BONUS/> bonus critical hit chance and <Ability:ONAROLL_CRIT_DAMAGE_BONUS/> critical hit damage for the remainder of the mission. Effect stacks up to <Ability:ONAROLL_MAX_STACKS/> times. Passive."
LocPromotionPopupText="<Bullet/> Every kill with your primary weapon grants <Ability:ONAROLL_CRIT_BONUS/> bonus critical hit chance and <Ability:ONAROLL_CRIT_DAMAGE_BONUS/> critical hit damage for the remainder of the mission.<br/><Bullet/> Effect stacks up to <Ability:ONAROLL_MAX_STACKS/> times.<br/><Bullet/> Passive.<br/>"

[F_QuickPatch X2AbilityTemplate]
LocFriendlyName="Quick Patch"
LocFlyOverText="Quick Patch"
LocLongDescription="Using a Medikit does not cost an action. Passive."
LocHelpText="Using a Medikit does not cost an action. Passive."
LocPromotionPopupText="<Bullet/> Using a Medikit does not cost an action.<br/><Bullet/> Applies to both Medikits and Nanomedikits.<br/><Bullet/> Applies to healing, stabilizing, and sedating.<br/><Bullet/> Passive.<br/>"

[F_Pistoleer X2AbilityTemplate]
LocFriendlyName="Pistoleer"
LocFlyOverText="Pistoleer"
LocLongDescription="Grants a free pistol utility item. Passive."
LocHelpText="Grants a free pistol utility item. Passive."
LocPromotionPopupText="<Bullet/> Grants a free pistol utility item.<br/><Bullet/> As XCOM researches new technologies, this ability will grant a more advanced pistol.<br/><Bullet/> Pistols that are equipped manually will override the effects of this ability.</br><Bullet/> Passive.</br>"

[F_StrongBack X2AbilityTemplate]
LocFriendlyName="Strong Back"
LocFlyOverText="Strong Back"
LocLongDescription="This soldier will no longer be weighed down by equipped utility items. Passive."
LocHelpText="This soldier will no longer be weighed down by equipped utility items. Passive."
LocPromotionPopupText="<Bullet/> This soldier will no longer be weighed down by equipped utility items.</br><Bullet/> Applies to items in Utility, Grenade, and Ammo slots.</br><Bullet/> Passive.</br>"

[F_Corpsman X2AbilityTemplate]
LocFriendlyName="Corpsman"
LocFlyOverText="Corpsman"
LocLongDescription="Passive."
LocHelpText="Passive."
LocPromotionPopupText="<Bullet/> Passive.</br>"

[F_Revive X2AbilityTemplate]
LocFriendlyName="Revive"
LocFlyOverText="Revive"
LocLongDescription="Passive."
LocHelpText="Passive."
LocPromotionPopupText="<Bullet/> Passive.</br>"


